{
  "books": [
    {
      "id": 1,
      "title": "The Alchemist",
      "author": "Paulo Coelho",
      "genre": "Classics",
      "description": "Paulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, of recognizing opportunity and learning to read the omens strewn along life's path, and, most importantly, to follow our dreams.",
      "rating": 3.85,
      "pages": "197",
      "published": 1988,
      "imageUrl": "https://images.gr-assets.com/books/1483412266l/865.jpg",
      "favorite": "no"
    },
    {
      "id": 2,
      "title": "Pride and Prejudice",
      "author": "Jane Austen",
      "genre": "Classics",
      "description": "Since its immediate success in 1813, Pride and Prejudice has remained one of the most popular novels in the English language. Jane Austen called this brilliant work 'her own darling child' and its vivacious heroine, Elizabeth Bennet, 'as delightful a creature as ever appeared in print.' The romantic clash between the opinionated Elizabeth and her proud beau, Mr. Darcy, is a splendid performance of civilized sparring. And Jane Austen's radiant wit sparkles as her characters dance a delicate quadrille of flirtation and intrigue, making this book the most superb comedy of manners of Regency England.",
      "rating": 4.25,
      "pages": 279,
      "published": 1813,
      "imageUrl": "https://images.gr-assets.com/books/1320399351l/1885.jpg",
      "favorite": "no"
    },
    {
      "id": 3,
      "title": "The Old Man and the Sea",
      "author": "Ernest Hemingway",
      "genre": "Classics",
      "description": "The last novel Ernest Hemingway saw published, The Old Man and the Sea has proved itself to be one of the enduring works of American fiction. It is the story of an old Cuban fisherman and his supreme ordeal: a relentless, agonizing battle with a giant marlin far out in the Gulf Stream. Using the simple, powerful language of a fable, Hemingway takes the timeless themes of courage in the face of defeat and personal triumph won from loss and transforms them into a magnificent twentieth-century classic.",
      "rating": 3.76,
      "pages": 132,
      "published": 1952,
      "imageUrl": "https://images.gr-assets.com/books/1329189714l/2165.jpg",
      "favorite": "no"
    },
    {
      "id": 4,
      "title": "The Da Vinci Code",
      "author": "Dan Brown ",
      "genre": "Mystery",
      "description": "An ingenious code hidden in the works of Leonardo da Vinci. A desperate race through the cathedrals and castles of Europe. An astonishing truth concealed for centuries . . . unveiled at last. While in Paris, Harvard symbologist Robert Langdon is awakened by a phone call in the dead of the night. The elderly curator of the Louvre has been murdered inside the museum, his body covered in baffling symbols. As Langdon and gifted French cryptologist Sophie Neveu sort through the bizarre riddles, they are stunned to discover a trail of clues hidden in the works of Leonardo da Vinci—clues visible for all to see and yet ingeniously disguised by the painter. Even more startling, the late curator was involved in the Priory of Sion—a secret society whose members included Sir Isaac Newton, Victor Hugo, and Da Vinci—and he guarded a breathtaking historical secret. Unless Langdon and Neveu can decipher the labyrinthine puzzle—while avoiding the faceless adversary who shadows their every move—the explosive, ancient truth will be lost forever.",
      "rating": 3.83,
      "pages": 489,
      "published": 2003,
      "imageUrl": "https://images.gr-assets.com/books/1551244853l/968.jpg",
      "favorite": "yes"
    },
    {
      "id": 5,
      "title": "Gone Girl",
      "author": "Gillian Flynn",
      "genre": "Mystery",
      "description": "One of the most critically acclaimed suspense writers of our time, New York Times bestseller Gillian Flynn takes that statement to its darkest place in this unputdownable masterpiece about a marriage gone terribly, terribly wrong. The Chicago Tribune proclaimed that her work “draws you in and keeps you reading with the force of a pure but nasty addiction.” Gone Girl’s toxic mix of sharp-edged wit and deliciously chilling prose creates a nerve-fraying thriller that confounds you at every turn. On a warm summer morning in North Carthage, Missouri, it is Nick and Amy Dunne’s fifth wedding anniversary. Presents are being wrapped and reservations are being made when Nick’s clever and beautiful wife disappears from their rented McMansion on the Mississippi River. Husband-of-the-Year Nick isn’t doing himself any favors with cringe-worthy daydreams about the slope and shape of his wife’s head, but passages from Amy's diary reveal the alpha-girl perfectionist could have put anyone dangerously on edge. Under mounting pressure from the police and the media—as well as Amy’s fiercely doting parents—the town golden boy parades an endless series of lies, deceits, and inappropriate behavior. Nick is oddly evasive, and he’s definitely bitter—but is he really a killer? As the cops close in, every couple in town is soon wondering how well they know the one that they love. With his twin sister, Margo, at his side, Nick stands by his innocence. Trouble is, if Nick didn’t do it, where is that beautiful wife? And what was in that silvery gift box hidden in the back of her bedroom closet? With her razor-sharp writing and trademark psychological insight, Gillian Flynn delivers a fast-paced, devilishly dark, and ingeniously plotted thriller that confirms her status as one of the hottest writers around.",
      "rating": 4.06,
      "pages": 415,
      "published": 2012,
      "imageUrl": "https://images.gr-assets.com/books/1554086139l/19288043.jpg",
      "favorite": "no"
    },
    {
      "id": 6,
      "title": "The Girl with the Dragon Tattoo",
      "author": "Stieg Larsson",
      "genre": "Mystery",
      "description": "An international publishing sensation, Stieg Larsson’s The Girl with the Dragon Tattoo combines murder mystery, family saga, love story, and financial intrigue into one satisfyingly complex and entertainingly atmospheric novel. Harriet Vanger, a scion of one of Sweden’s wealthiest families disappeared over forty years ago. All these years later, her aged uncle continues to seek the truth. He hires Mikael Blomkvist, a crusading journalist recently trapped by a libel conviction, to investigate. He is aided by the pierced and tattooed punk prodigy Lisbeth Salander. Together they tap into a vein of unfathomable iniquity and astonishing corruption. ",
      "rating": 4.13,
      "pages": 465,
      "published": 2008,
      "imageUrl": "https://images.gr-assets.com/books/1327868566l/2429135.jpg",
      "favorite": "no"
    },
    {
      "id": 7,
      "title": "The Shining",
      "author": "Stephen King",
      "genre": "Horror",
      "description": "Jack Torrance's new job at the Overlook Hotel is the perfect chance for a fresh start. As the off-season caretaker at the atmospheric old hotel, he'll have plenty of time to spend reconnecting with his family and working on his writing. But as the harsh winter weather sets in, the idyllic location feels ever more remote...and more sinister. And the only one to notice the strange and terrible forces gathering around the Overlook is Danny Torrance, a uniquely gifted five-year-old.",
      "rating": 4.21,
      "pages": 447,
      "published": 1977,
      "imageUrl": "https://images.gr-assets.com/books/1353277730l/11588.jpg",
      "favorite": "no"
    },
    {
      "id": 8,
      "title": "The Exorcist",
      "author": "William Peter Blatty",
      "genre": "Horror",
      "description": "Originally published in 1971, The Exorcist is now a major television series on FOX. It remains one of the most controversial novels ever written and went on to become a literary phenomenon: It spent fifty-seven weeks on the New York Times bestseller list, seventeen consecutively at number one. Inspired by a true story of a child’s demonic possession in the 1940s, William Peter Blatty created an iconic novel that focuses on Regan, the eleven-year-old daughter of a movie actress residing in Washington, D.C. A small group of overwhelmed yet determined individuals must rescue Regan from her unspeakable fate, and the drama that ensues is gripping and unfailingly terrifying. Two years after its publication, The Exorcist was, of course, turned into a wildly popular motion picture, garnering ten Academy Award nominations. On opening day of the film, lines of the novel’s fans stretched around city blocks. In Chicago, frustrated moviegoers used a battering ram to gain entry through the double side doors of a theater. In Kansas City, police used tear gas to disperse an impatient crowd who tried to force their way into a cinema. The three major television networks carried footage of these events; CBS’s Walter Cronkite devoted almost ten minutes to the story. The Exorcist was, and is, more than just a novel and a film: it is a true landmark. Purposefully raw and profane, The Exorcist still has the extraordinary ability to disturb readers and cause them to forget that it is “just a story.” Published here in this beautiful fortieth anniversary edition, it remains an unforgettable reading experience and will continue to shock and frighten a new generation of readers.",
      "rating": 4.16,
      "pages": 385,
      "published": 1971,
      "imageUrl": "https://images.gr-assets.com/books/1375168676l/179780.jpg",
      "favorite": "no"
    },
    {
      "id": 9,
      "title": "The Notebook",
      "author": "Nicholas Sparks",
      "genre": "Romance",
      "description": "A man with a faded, well-worn notebook open in his lap. A woman experiencing a morning ritual she doesn't understand. Until he begins to read to her. An achingly tender story about the enduring power of love. A man with a faded, well-worn notebook open in his lap. A woman experiencing a morning ritual she doesn't understand. Until he begins to read to her. The Notebook is an achingly tender story about the enduring power of love, a story of miracles that will stay with you forever. Set amid the austere beauty of coastal North Carolina in 1946, The Notebook begins with the story of Noah Calhoun, a rural Southerner returned home from World War II. Noah, thirty-one, is restoring a plantation home to its former glory, and he is haunted by images of the beautiful girl he met fourteen years earlier, a girl he loved like no other. Unable to find her, yet unwilling to forget the summer they spent together, Noah is content to live with only memories...until she unexpectedly returns to his town to see him once again.  Allie Nelson, twenty-nine, is now engaged to another man, but realizes that the original passion she felt for Noah has not dimmed with the passage of time. Still, the obstacles that once ended their previous relationship remain, and the gulf between their worlds is too vast to ignore. With her impending marriage only weeks away, Allie is forced to confront her hopes and dreams for the future, a future that only she can shape. Like a puzzle within a puzzle, the story of Noah and Allie is just the beginning. As it unfolds, their tale miraculously becomes something different, with much higher stakes. The result is a deeply moving portrait of love itself, the tender moments and the fundamental changes that affect us all. Shining with a beauty that is rarely found in current literature, The Notebook establishes Nicholas Sparks as a classic storyteller with a unique insight into the only emotion that really matters. 'I am nothing special, of this I am sure. I am a common man with common thoughts and I've led a common life. There are no monuments dedicated to me and my name will soon be forgotten, but I've loved another with all my heart and soul, and to me, this has always been enough.' ",
      "rating": 4.08,
      "pages": 214,
      "published": 1996,
      "imageUrl": "https://images.gr-assets.com/books/1385738917l/15931.jpg",
      "favorite": "no"
    },
    {
      "id": 10,
      "title": "Beautiful Disaster",
      "author": "Jamie McGuire",
      "genre": "Romance",
      "description": "The new Abby Abernathy is a good girl. She doesn’t drink or swear, and she has the appropriate number of cardigans in her wardrobe. Abby believes she has enough distance from the darkness of her past, but when she arrives at college with her best friend, her path to a new beginning is quickly challenged by Eastern University's Walking One-Night Stand. Travis Maddox, lean, cut, and covered in tattoos, is exactly what Abby needs—and wants—to avoid. He spends his nights winning money in a floating fight ring, and his days as the ultimate college campus charmer. Intrigued by Abby’s resistance to his appeal, Travis tricks her into his daily life with a simple bet. If he loses, he must remain abstinent for a month. If Abby loses, she must live in Travis’s apartment for the same amount of time. Either way, Travis has no idea that he has met his match.",
      "rating": 4.12,
      "pages": 319,
      "published": 2011,
      "imageUrl": "https://images.gr-assets.com/books/1358259032l/11505797.jpg",
      "favorite": "no"
    },
    {
      "id": 11,
      "title": "The Fault in Our Stars",
      "author": "John Green",
      "genre": "Romance",
      "description": "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten. Insightful, bold, irreverent, and raw, The Fault in Our Stars is award-winning author John Green's most ambitious and heartbreaking work yet, brilliantly exploring the funny, thrilling, and tragic business of being alive and in love.",
      "rating": 4.23,
      "pages": 313,
      "published": 2012,
      "imageUrl": "https://images.gr-assets.com/books/1360206420l/11870085.jpg",
      "favorite": "no"
    },
    {
      "id": 12,
      "title": "1984",
      "author": "George Orwell",
      "genre": "Classics",
      "description": "The year 1984 has come and gone, but George Orwell's prophetic, nightmarish vision in 1949 of the world we were becoming is timelier than ever. 1984 is still the great modern classic of 'negative utopia'—a startlingly original and haunting novel that creates an imaginary world that is completely convincing, from the first sentence to the last four words. No one can deny the novel's hold on the imaginations of whole generations, or the power of its admonitions—a power that seems to grow, not lessen, with the passage of time.",
      "rating": 4.17,
      "pages": 326,
      "published": 1949,
      "imageUrl": "https://images.gr-assets.com/books/1348990566l/5470.jpg",
      "favorite": "no"
    },
    {
      "id": 13,
      "title": "The Lord of the Rings",
      "author": "J.R.R. Tolkien",
      "genre": "Fantasy",
      "description": "One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind them. In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, the Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell by chance into the hands of the hobbit Bilbo Baggins. From Sauron's fastness in the Dark Tower of Mordor, his power spread far and wide. Sauron gathered all the Great Rings to him, but always he searched for the One Ring that would complete his dominion. When Bilbo reached his eleventy-first birthday he disappeared, bequeathing to his young cousin Frodo the Ruling Ring and a perilous quest: to journey across Middle-earth, deep into the shadow of the Dark Lord, and destroy the Ring by casting it into the Cracks of Doom. The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the Wizard; the hobbits Merry, Pippin, and Sam; Gimli the Dwarf; Legolas the Elf; Boromir of Gondor; and a tall, mysterious stranger called Strider.",
      "rating": "4.49",
      "pages": "1216",
      "published": "1955",
      "imageUrl": "https://images.gr-assets.com/books/1547450792l/33.jpg",
      "favorite": "no"
    },
    {
      "id": 14,
      "title": "The Art of War",
      "author": "Sun Tzu",
      "genre": "Psychology",
      "description": "Twenty-Five Hundred years ago, Sun Tzu wrote this classic book of military strategy based on Chinese warfare and military thought. Since that time, all levels of military have used the teaching on Sun Tzu to warfare and civilization have adapted these teachings for use in politics, business and everyday life. The Art of War is a book which should be used to gain advantage of opponents in the boardroom and battlefield alike.",
      "rating": 3.97,
      "pages": 273,
      "published": 2005,
      "imageUrl": "https://images.gr-assets.com/books/1453417993l/10534.jpg",
      "favorite": "no"
    },
    {
      "id": 15,
      "title": "Harry Potter and the Deathly Hallows",
      "author": "J.K. Rowling",
      "genre": "Fantasy",
      "description": "Harry Potter is leaving Privet Drive for the last time. But as he climbs into the sidecar of Hagrid’s motorbike and they take to the skies, he knows Lord Voldemort and the Death Eaters will not be far behind. The protective charm that has kept him safe until now is broken. But the Dark Lord is breathing fear into everything he loves. And he knows he can’t keep hiding. To stop Voldemort, Harry knows he must find the remaining Horcruxes and destroy them.He will have to face his enemy in one final battle.",
      "rating": "4.62",
      "pages": 759,
      "published": 2007,
      "imageUrl": "https://images.gr-assets.com/books/1474171184l/136251.jpg",
      "favorite": "yes"
    },
    {
      "id": 16,
      "title": "The Monk Who Sold His Ferrari",
      "author": "Robin S. Sharma",
      "genre": "Psychology",
      "description": "Wisdom to Create a Life of Passion, Purpose, and Peace. This inspiring tale provides a step-by-step approach to living with greater courage, balance, abundance, and joy. A wonderfully crafted fable, The Monk Who Sold His Ferrari tells the extraordinary story of Julian Mantle, a lawyer forced to confront the spiritual crisis of his out-of-balance life. On a life-changing odyssey to an ancient culture, he discovers powerful, wise, and practical lessons that teach us to: Develop Joyful Thoughts, Follow Our Life's Mission and Calling, Cultivate Self-Discipline and Act Courageously, Value Time as Our Most Important Commodity, Nourish Our Relationships, and Live Fully, One Day at a Time.",
      "rating": 3.82,
      "pages": 208,
      "published": 1996,
      "imageUrl": "https://images.gr-assets.com/books/1388189325l/43877.jpg",
      "favorite": "no"
    },
    {
      "id": 17,
      "title": "The Power of Habit",
      "author": "Charles Duhigg",
      "genre": "Psychology",
      "description": "A young woman walks into a laboratory. Over the past two years, she has transformed almost every aspect of her life. She has quit smoking, run a marathon, and been promoted at work. The patterns inside her brain, neurologists discover, have fundamentally changed.Marketers at Procter & Gamble study videos of people making their beds. They are desperately trying to figure out how to sell a new product called Febreze, on track to be one of the biggest flops in company history. Suddenly, one of them detects a nearly imperceptible pattern—and with a slight shift in advertising, Febreze goes on to earn a billion dollars a year. An untested CEO takes over one of the largest companies in America. His first order of business is attacking a single pattern among his employees—how they approach worker safety—and soon the firm, Alcoa, becomes the top performer in the Dow Jones.\n\nWhat do all these people have in common? They achieved success by focusing on the patterns that shape every aspect of our lives. They succeeded by transforming habits.In The Power of Habit, award-winning New York Times business reporter Charles Duhigg takes us to the thrilling edge of scientific discoveries that explain why habits exist and how they can be changed. With penetrating intelligence and an ability to distill vast amounts of information into engrossing narratives, Duhigg brings to life a whole new understanding of human nature and its potential for transformation. \n\nAlong the way we learn why some people and companies struggle to change, despite years of trying, while others seem to remake themselves overnight. We visit laboratories where neuroscientists explore how habits work and where, exactly, they reside in our brains. We discover how the right habits were crucial to the success of Olympic swimmer Michael Phelps, Starbucks CEO Howard Schultz, and civil-rights hero Martin Luther King, Jr. We go inside Procter & Gamble, Target superstores, Rick Warren’s Saddleback Church, NFL locker rooms, and the nation’s largest hospitals and see how implementing so-called keystone habits can earn billions and mean the difference between failure and success, life and death.\n\nAt its core, The Power of Habit contains an exhilarating argument: The key to exercising regularly, losing weight, raising exceptional children, becoming more productive, building revolutionary companies and social movements, and achieving success is understanding how habits work. Habits aren’t destiny. As Charles Duhigg shows, by harnessing this new science, we can transform our businesses, our communities, and our lives.",
      "rating": 4.08,
      "pages": 375,
      "published": 2012,
      "imageUrl": "https://images.gr-assets.com/books/1545854312l/12609433.jpg",
      "favorite": "yes"
    },
    {
      "id": 18,
      "title": "The 48 Laws of Power",
      "author": "Robert Greene",
      "genre": "Psychology",
      "description": "This amoral, cunning, ruthless, and instructive book synthesizes the philosophies of Machiavelli, Sun Tzu, and Carl Von Clausewitz with the historical legacies of statesmen, warriors, seducers, and con men throughout the ages.",
      "rating": 4.19,
      "pages": 4.52,
      "published": 1998,
      "imageUrl": "https://images.gr-assets.com/books/1385228992l/1303.jpg",
      "favorite": "no"
    },
    {
      "id": 19,
      "title": "Don Quixote",
      "author": "Miguel de Cervantes Saavedra",
      "genre": "Classics",
      "description": "Don Quixote has become so entranced by reading chivalric romances, that he determines to become a knight-errant himself. In the company of his faithful squire, Sancho Panza, his exploits blossom in all sorts of wonderful ways. While Quixote's fancy often leads him astray – he tilts at windmills, imagining them to be giants – Sancho acquires cunning and a certain sagacity. Sane madman and wise fool, they roam the world together, and together they have haunted readers' imaginations for nearly four hundred years.\n\nWith its experimental form and literary playfulness, Don Quixote generally has been recognized as the first modern novel. The book has had enormous influence on a host of writers, from Fielding and Sterne to Flaubert, Dickens, Melville, and Faulkner, who reread it once a year, 'just as some people read the Bible.'",
      "rating": 3.87,
      "pages": 1023,
      "published": 1605,
      "imageUrl": "https://images.gr-assets.com/books/1546112331l/3836.jpg",
      "favorite": "no"
    }
  ]
}